# ИГРА ВИСЕЛИЦА
# (реализуем через список)
import random

def rendering(counter):
   if counter == 9:
      print ("""
      |
      |
      |
      |
      |
      |
   ======""")
   if counter == 8:
      print ("""
      ____________
      |
      |
      |
      |
      |
      |
   ======""")
   if counter == 7:
      print ("""
      ____________
      |  /
      | /
      |/
      |
      |
      |
   ======""")
   if counter == 6:
      print ("""
      ____________
      |  /    |
      | /     |
      |/
      |
      |
      |
   ======""")
   if counter == 5:
      print ("""
      ____________
      |  /    |
      | /     |
      |/    [*_*]
      |
      |
      |
   ======""")
   if counter == 4:
      print ("""
      ____________
      |  /    |
      | /     |
      |/    [*_*]
      |       |
      |       |
      |      
   ======""")
   if counter == 3:
      print ("""
      ____________
      |  /    |
      | /     |
      |/    [*_*]
      |      /|
      |       |
      |      
   ======""")
   if counter == 2:
      print ("""
      ____________
      |  /    |
      | /     |
      |/    [*_*]
      |      /|/
      |       |
      |      
   ======""")
   if counter == 1:
      print ( """
      ____________
      |  /    |
      | /     |
      |/    [*_*]
      |      /|/
      |       |
      |      / 
   ======""")
   if counter == 0:
      print (
         """ 
       __________________
      |                  | 
      | ! ВЫ ПРОИГРАЛИ ! |
      |__________________|
      """ + """
      ____________
      |  /    |
      | /     |
      |/    [*_*]
      |      /|/
      |       |
      |      / /
   ======""")

words = ["аист", "акула", "бабуин", "баран", "барсук", "бобр", "бык", "варан", "верблюд", "волк", "вомбат", "воробей", "ворон", "выдра",
"голубь", "гусь", "додо", "дятел", "енот", "ехидна", "еж", "жаба", "жираф", "журавль", "заяц", "зебра", "землеройка", "зяблик",
"игуана", "кабан", "казуар", "кайман", "какаду", "кальмар", "камбала", "канарейка", "каракатица", "карп", "кенгуру",
"киви", "кит", "лама", "ламантин", "ласка", "ласточка", "лебедь", "лев", "лемур", "ленивец", "леопард", "лиса", "лягушка",
"мотылек", "муравьед", "муравей", "мангуст", "медведь", "морж", "муха", "мышь", "медуза", "нарвал", "носорог", "орел", "омар", "олень", "овцебык",
"осьминог", "орел", "осел", "оса", "овца", "опоссум", "обезьяна", "паук", "пескарь", "пингвин", "пиранья", "попугай",
"пчела", "рысь", "рыба", "росомаха", "страус", "сурок", "стрекоза", "сорока", "сова", "снегирь", "сокол", "собака", "слон",
"слон", "скорпион", "скворец", "скат", "сельдь", "свинья", "сурикат", "скунс", "слизень", "светлячок", "тюлень", "тукан", "тигр",
"трясогуска", "термит", "тетерев", "тунец", "тритон", "тарантул", "таракан", "тля", "утконос", "уж", "устрица", "улитка", "угорь", "фазан", "фламинго",
"форель", "хорек", "хомяк", "хамелеон", "цапля", "цесарка", "цикада", "черепаха", "червь", "чайка", "шимпанзе", "шиншилла",
"щука", "эму", "ящерица", "ястреб", "як", "ягуар"]
word = words[random.randrange(len(words))]
counter = 10
len_word = len(word)
word_block = []  #"_" * len(word)
for i in range(len(word)):
   word_block += "_"
replay_get = ""

print( "\tВИСЕЛИЦА\n Правила:\nИгроку загадывается слово(тема - животные ).\n! 1 ход - 1 буква !\n10 шансов на ошибку.\nПосле игрок погибает.\n")
#print(word)
print(word_block)

while counter != 0 and len_word != 0 :
   while True:
      get = input("Введите букву => ")
      
      if len(get)>1 or get not in 'абвгдеёжзийклмнопрстуфхцчшщъыьэюя':
         print("!Введите одну строчную букву! ")
      elif get in replay_get:
         print("!Вы уже вводли эту букву! ( " + replay_get + " ) ")
      else:
            replay_get = " " + get
            break
   
   change = False
   index = 0
   for i in word:
      if get in i:
         # замена в word_block угаданно буквы - get == i
         word_block[index] = i
         len_word -= 1
         change = True
      index += 1

   if change :
      print("\nХорошо, такая буква есть в слове => " + str(word_block))
   else:
      counter -= 1
      print("\n!Увы, такой буква нет в слове!\n[" + str(counter) + " / 10]  => " + str(word_block))
      rendering(counter)
   if counter != 0 and len_word == 0:
      print(""" 
       _________________
      |                 | 
      | ! ВЫ ПОБЕДИЛИ ! |
      |_________________|
      """)
